---
kind: property
id: P:Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.ProfileType
source: html/baa1239d-62a2-2091-1dc9-f8c2671cc6fe.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.ProfileType Property

The shape of the straight.

## Syntax (C#)
```csharp
public ConnectorProfileType ProfileType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration